app/controllers/products_controller.rb

  def index
    if user_signed_in? #TODO: complete _product.html.erb
      @wishlists = Wishlist.find :all, :conditions => { :user_id => current_user.id}
    end
    @products = Product.find :all
---
SELECT * FROM "products"

  def show
    if user_signed_in?
      @wishlists = Wishlist.find :all, :conditions => { :user_id => current_user.id}
    end
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def update
   if admin_signed_in?
      @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)